define({
	"error.0": "เกิดข้อผิดพลาดในการตรวจสอบ URL",
	"error.400": "ข้อมูลไม่ถูกต้อง ไม่สามารถส่งข้อมูลได้",
	"error.401": "เกิดข้อผิดพลาด ไม่มีสิทธิ์ในการเข้าถึงข้อมูล",
	"error.402": "กรุณาชำระเงินก่อน",
	"error.403": "ไม่ได้รับอนุญาตในการเข้าถึงข้อมูล",
	"error.404": "ไม่พบข้อมูล",
	"error.405": "ไม่ได้รับอนุญาตในการเข้าถึงข้อมูลทาง Method นี้",
	"error.406": "Browser ไม่รองรับข้อมูลดังกล่าว",
	"error.407": "ต้องการ การอนุญาตจาก Proxy",
	"error.408": "ไม่มีการตอบสนองจาก Server ",
	"error.409": "เกิดการชนกันของข้อมูล
เนื่องจากการส่งข้อมูลในเวลาเดียวกัน",
	"error.410": "ไม่พบเนื้อหาดังกล่าว",
	"error.411": "Server จำกัดขนาดของ Request
ไม่สามารถตรวจสอบ Link ได้",
	"error.412": "Precondition ไม่ถูกต้อง
ไม่สามารถตรวจสอบ Link ได้",
	"error.413": "Request มีขนาดใหญ่เกินกว่าที่ Server จะรับได้",
	"error.414": "URI ยาวเกินกว่าที่ Server อนุญาต",
	"error.415": "Server ไม่รองรับชนิดข้อมูลที่ส่ง",
	"error.416": "Server ไม่รองรับช่วงของ Request ที่ส่ง",
	"error.417": "Server ไม่สามารถตอบสนองในสิ่งที่ร้องขอได้",
	"error.418": "ฉันเป็นถ้วยน้ำชา ;-)",
	"error.500": "การส่งข้อมูลของ Server ผิดพลาด",
	"error.501": "Server ไม่สามารถตอบสนอง Method ที่ระบุได้",
	"error.502": "เกิดข้อผิดพลาดที่ Gateway ไม่สามารถส่งข้อมูลได้",
	"error.503": "Server ทำงานหนัก ไม่สามารถตอบสนองได้ ",
	"error.504": "ไม่มีกาารตอบสนองจาก Gateway",
	"error.505": "Server ไม่รองรับ HTTP รุ่นที่ส่ง"
});
